app/controllers/textfiles_controller.rb

  def index
    @textfiles = Textfile.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 50, :page => params[:page])
---
SELECT * FROM "textfiles" WHERE (content LIKE '%esprit%' OR filepath LIKE '%esprit%')

  def show
    @textfile = Textfile.find(params[:id])
---
SELECT * FROM "textfiles" WHERE ("textfiles"."id" = 1)

  def edit
    @textfile = Textfile.find(params[:id])
---
SELECT * FROM "textfiles" WHERE ("textfiles"."id" = 1)

  def create
    @textfile = Textfile.new(params[:textfile])
    @textfile.needs_fs_update = true

    respond_to do |format|
      if @textfile.save
---
INSERT INTO "textfiles" ("created_at", "updated_at", "accessed_at", "filepath", "content") VALUES('2009-08-04 14:49:10', '2009-08-04 14:49:10', '2009-08-04 14:48:00', '/Data/vtrak1/readme', ';lkajsdfl;kjasdf')

  def update
    @textfile = Textfile.find(params[:id])
    @textfile.needs_fs_update = true

    respond_to do |format|
      if @textfile.update_attributes(params[:textfile])
---
SELECT * FROM "textfiles" WHERE ("textfiles"."id" = 1)
UPDATE "textfiles" SET "updated_at" = '2009-08-04 19:16:45', "accessed_at" = '2009-08-04 19:16:00', "content" = 'Directory Index: